{
	"patcher" : 	{
		"fileversion" : 1,
		"appversion" : 		{
			"major" : 8,
			"minor" : 0,
			"revision" : 5,
			"architecture" : "x64",
			"modernui" : 1
		}
,
		"classnamespace" : "box",
		"rect" : [ 51.0, 79.0, 862.0, 565.0 ],
		"bglocked" : 0,
		"openinpresentation" : 0,
		"default_fontsize" : 12.0,
		"default_fontface" : 0,
		"default_fontname" : "Arial",
		"gridonopen" : 1,
		"gridsize" : [ 15.0, 15.0 ],
		"gridsnaponopen" : 1,
		"objectsnaponopen" : 1,
		"statusbarvisible" : 2,
		"toolbarvisible" : 1,
		"lefttoolbarpinned" : 0,
		"toptoolbarpinned" : 0,
		"righttoolbarpinned" : 0,
		"bottomtoolbarpinned" : 0,
		"toolbars_unpinned_last_save" : 0,
		"tallnewobj" : 0,
		"boxanimatetime" : 200,
		"enablehscroll" : 1,
		"enablevscroll" : 1,
		"devicewidth" : 0.0,
		"description" : "",
		"digest" : "",
		"tags" : "",
		"style" : "",
		"subpatcher_template" : "",
		"boxes" : [ 			{
				"box" : 				{
					"fontname" : "Arial",
					"fontsize" : 12.0,
					"id" : "obj-45",
					"maxclass" : "newobj",
					"numinlets" : 2,
					"numoutlets" : 2,
					"outlettype" : [ "", "" ],
					"patching_rect" : [ 442.399993999999992, 266.0, 44.0, 22.0 ],
					"text" : "gate 2"
				}

			}
, 			{
				"box" : 				{
					"fontname" : "Arial",
					"fontsize" : 12.0,
					"hidden" : 1,
					"id" : "obj-19",
					"maxclass" : "message",
					"numinlets" : 2,
					"numoutlets" : 1,
					"outlettype" : [ "" ],
					"patching_rect" : [ 334.0, 597.0, 81.0, 22.0 ],
					"text" : "clean, wclose",
					"varname" : "wclose"
				}

			}
, 			{
				"box" : 				{
					"fontname" : "Arial",
					"fontsize" : 12.0,
					"hidden" : 1,
					"id" : "obj-47",
					"maxclass" : "newobj",
					"numinlets" : 1,
					"numoutlets" : 1,
					"outlettype" : [ "" ],
					"patching_rect" : [ 333.5, 652.0, 262.0, 22.0 ],
					"text" : "linksections 1 1 k \"Through The Looking Glass\""
				}

			}
, 			{
				"box" : 				{
					"fontname" : "Arial",
					"fontsize" : 12.0,
					"hidden" : 1,
					"id" : "obj-51",
					"maxclass" : "newobj",
					"numinlets" : 1,
					"numoutlets" : 2,
					"outlettype" : [ "", "" ],
					"patching_rect" : [ 333.5, 624.5, 69.0, 22.0 ],
					"save" : [ "#N", "thispatcher", ";", "#Q", "end", ";" ],
					"text" : "thispatcher"
				}

			}
, 			{
				"box" : 				{
					"fontname" : "Arial",
					"fontsize" : 12.0,
					"id" : "obj-32",
					"maxclass" : "newobj",
					"numinlets" : 0,
					"numoutlets" : 0,
					"patcher" : 					{
						"fileversion" : 1,
						"appversion" : 						{
							"major" : 8,
							"minor" : 0,
							"revision" : 5,
							"architecture" : "x64",
							"modernui" : 1
						}
,
						"classnamespace" : "box",
						"rect" : [ 493.0, 142.0, 442.0, 122.0 ],
						"bglocked" : 0,
						"openinpresentation" : 0,
						"default_fontsize" : 12.0,
						"default_fontface" : 0,
						"default_fontname" : "Arial",
						"gridonopen" : 1,
						"gridsize" : [ 15.0, 15.0 ],
						"gridsnaponopen" : 1,
						"objectsnaponopen" : 1,
						"statusbarvisible" : 2,
						"toolbarvisible" : 1,
						"lefttoolbarpinned" : 0,
						"toptoolbarpinned" : 0,
						"righttoolbarpinned" : 0,
						"bottomtoolbarpinned" : 0,
						"toolbars_unpinned_last_save" : 0,
						"tallnewobj" : 0,
						"boxanimatetime" : 200,
						"enablehscroll" : 1,
						"enablevscroll" : 1,
						"devicewidth" : 0.0,
						"description" : "",
						"digest" : "",
						"tags" : "",
						"style" : "",
						"subpatcher_template" : "",
						"boxes" : [ 							{
								"box" : 								{
									"fontname" : "Arial",
									"fontsize" : 12.0,
									"id" : "obj-8",
									"linecount" : 2,
									"maxclass" : "comment",
									"numinlets" : 1,
									"numoutlets" : 0,
									"patching_rect" : [ 5.0, 79.0, 432.0, 33.0 ],
									"text" : "In the simple situation, with no polyphony inside each voice, one can completely ignore the Ties outlet: all ties, however, will be zeros!!"
								}

							}
, 							{
								"box" : 								{
									"fontname" : "Arial",
									"fontsize" : 12.0,
									"id" : "obj-6",
									"linecount" : 5,
									"maxclass" : "comment",
									"numinlets" : 1,
									"numoutlets" : 0,
									"patching_rect" : [ 7.0, 4.0, 429.0, 74.0 ],
									"text" : "[bach.tierev] is only needed if one has not-completely tied chords. In this case (and JUST in this case), beatunbox will still have some 1's at its Ties outlet.\nLuckily, there's a this abstraction which reverse the flux of ties for us! And it's exactly what we need to properly assign the new ties. If you are curious of how this is achieved, have a quick look into the abstraction!"
								}

							}
 ],
						"lines" : [  ]
					}
,
					"patching_rect" : [ 705.0, 289.0, 102.0, 22.0 ],
					"saved_object_attributes" : 					{
						"description" : "",
						"digest" : "",
						"globalpatchername" : "",
						"tags" : ""
					}
,
					"text" : "p \"what's tierev?\""
				}

			}
, 			{
				"box" : 				{
					"fontname" : "Arial",
					"fontsize" : 12.0,
					"id" : "obj-48",
					"maxclass" : "comment",
					"numinlets" : 1,
					"numoutlets" : 0,
					"patching_rect" : [ 536.0, 77.0, 86.0, 20.0 ],
					"text" : "some presets:"
				}

			}
, 			{
				"box" : 				{
					"fontname" : "Arial",
					"fontsize" : 12.0,
					"id" : "obj-46",
					"linecount" : 5,
					"maxclass" : "comment",
					"numinlets" : 1,
					"numoutlets" : 0,
					"patching_rect" : [ 736.0, 134.0, 91.0, 74.0 ],
					"text" : "as usual, we automatically re-dump when changed with mouse"
				}

			}
, 			{
				"box" : 				{
					"fontname" : "Arial",
					"fontsize" : 12.0,
					"id" : "obj-41",
					"maxclass" : "newobj",
					"numinlets" : 0,
					"numoutlets" : 0,
					"patcher" : 					{
						"fileversion" : 1,
						"appversion" : 						{
							"major" : 8,
							"minor" : 0,
							"revision" : 5,
							"architecture" : "x64",
							"modernui" : 1
						}
,
						"classnamespace" : "box",
						"rect" : [ 782.0, 580.0, 446.0, 117.0 ],
						"bglocked" : 0,
						"openinpresentation" : 0,
						"default_fontsize" : 12.0,
						"default_fontface" : 0,
						"default_fontname" : "Arial",
						"gridonopen" : 1,
						"gridsize" : [ 15.0, 15.0 ],
						"gridsnaponopen" : 1,
						"objectsnaponopen" : 1,
						"statusbarvisible" : 2,
						"toolbarvisible" : 1,
						"lefttoolbarpinned" : 0,
						"toptoolbarpinned" : 0,
						"righttoolbarpinned" : 0,
						"bottomtoolbarpinned" : 0,
						"toolbars_unpinned_last_save" : 0,
						"tallnewobj" : 0,
						"boxanimatetime" : 200,
						"enablehscroll" : 1,
						"enablevscroll" : 1,
						"devicewidth" : 0.0,
						"description" : "",
						"digest" : "",
						"tags" : "",
						"style" : "",
						"subpatcher_template" : "",
						"boxes" : [ 							{
								"box" : 								{
									"fontname" : "Arial",
									"fontsize" : 12.0,
									"id" : "obj-5",
									"linecount" : 6,
									"maxclass" : "comment",
									"numinlets" : 1,
									"numoutlets" : 0,
									"patching_rect" : [ 7.0, 8.0, 438.0, 89.0 ],
									"text" : "...well, ties are a bridge between durations and pitches. Thus if you reverse ties without reversing pitches, something odd my happen to your durations as well. This affects the not-completely tied chords, and it's not a matter of algorithm, it's a matter of principle: what does it mean to keep the tie pattern when the tied notes change (and thus one has no more guarantee that previously tied notes change accordingly)?"
								}

							}
 ],
						"lines" : [  ]
					}
,
					"patching_rect" : [ 792.0, 472.0, 49.0, 22.0 ],
					"saved_object_attributes" : 					{
						"description" : "",
						"digest" : "",
						"globalpatchername" : "",
						"tags" : ""
					}
,
					"text" : "p why?"
				}

			}
, 			{
				"box" : 				{
					"fontname" : "Arial",
					"fontsize" : 12.0,
					"id" : "obj-35",
					"linecount" : 6,
					"maxclass" : "comment",
					"numinlets" : 1,
					"numoutlets" : 0,
					"patching_rect" : [ 733.0, 385.0, 115.0, 87.0 ],
					"text" : "preset 3 contains not-completely tied chords! See what happens when reversing without reversing pitches..."
				}

			}
, 			{
				"box" : 				{
					"id" : "obj-31",
					"maxclass" : "preset",
					"numinlets" : 1,
					"numoutlets" : 4,
					"outlettype" : [ "preset", "int", "preset", "int" ],
					"patching_rect" : [ 619.0, 78.0, 91.0, 16.0 ],
					"preset_data" : [ 						{
							"number" : 1,
							"data" : [ 5, "obj-1", "bach.score", "begin_preset", 851, 256, "obj-1", "bach.score", "restore_preset", 0, 250, "score", "(", "slotinfo", "(", 1, "amplitude envelope", "function", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1080016896, 97, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 2, "slot function", "function", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 113, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 3, "slot longlist", "intlist", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1080016896, 119, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 4, "slot floatlist", "floatlist", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 101, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 5, "slot long", "int", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1080016896, 114, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 6, "slot float", "float", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 116, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 7, "slot text", "text", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 121, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 8, "filelist", "filelist", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 117, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 9, "spat", "spat", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1076101120, 105, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 10, "slot 10", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 11, "slot 11", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 12, "slot 12", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 13, "slot 13", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 14, "slot 14", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 15, "slot 15", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 256, "obj-1", "bach.score", "restore_preset", 250, 250, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 16, "slot 16", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 17, "slot 17", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 18, "slot 18", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 19, "slot 19", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 20, "slot 20", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 21, "slot 21", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 22, "slot 22", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 23, "slot 23", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 24, "slot 24", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 25, "slot 25", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 26, "slot 26", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 27, "slot 27", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 28, "slot 28", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 29, "slot 29", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 30, "slot 30", "none", 256, "obj-1", "bach.score", "restore_preset", 500, 250, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", ")", "(", "commands", "(", 1, "notecmd", "chordcmd", 0, ")", "(", 2, "notecmd", "chordcmd", 0, ")", "(", 3, "notecmd", "chordcmd", 0, ")", "(", 4, "notecmd", "chordcmd", 0, ")", "(", 5, "notecmd", "chordcmd", 0, ")", ")", "(", "clefs", "G", ")", "(", "keys", "CM", ")", "(", "midichannels", 1, ")", "(", "(", "(", "(", 4, 4, ")", "(", ")", ")", "(", "1/12", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1086147584, 127, 0, 0, ")", 0, ")", "(", "1/12", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1085865984, 127, 0, 0, ")", 0, ")", "(", "1/12", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1086045184, 127, 0, 0, ")", 0, ")", "(", "1/8", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1086070784, 127, 0, 0, ")", 0, ")", "(", "1/8", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1085891584, 127, 0, 0, ")", 0, ")", "(", "3/16", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1086301184, 127, 0, 0, ")", 0, ")", "(", "1/16", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1085993984, 127, 0, 0, ")", 0, ")", "(", "1/8", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1086096384, 127, 0, 0, ")", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1086338560, 127, 0, 0, ")", 0, ")", "(", "1/8", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1085942784, 127, 0, 0, ")", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1086338560, 127, 1, 0, ")", 0, ")", 0, ")", "(", "(", "(", 4, 4, ")", "(", ")", ")", "(", "1/4", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1086338560, 127, 1, 0, ")", 0, ")", "(", "1/12", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1086338560, 127, 0, 0, ")", 0, ")", "(", "1/6", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1086338560, 127, 0, 0, ")", 0, ")", "(", "1/6", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1086092726, 127, 0, 0, ")", 107, "obj-1", "bach.score", "restore_preset", 750, 101, 0, ")", "(", "1/12", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1085865984, 127, 1, 0, ")", 0, ")", "(", "1/28", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1085865984, 127, 0, 0, ")", 0, ")", "(", "1/28", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1085968384, 127, 0, 0, ")", 0, ")", "(", "1/28", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1085865984, 127, 0, 0, ")", 0, ")", "(", "1/28", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1085865984, 127, 0, 0, ")", 0, ")", "(", "1/28", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1085789184, 127, 0, 0, ")", 0, ")", "(", "1/28", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1085865984, 127, 0, 0, ")", 0, ")", "(", "1/28", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1085865984, 127, 0, 0, ")", 0, ")", 0, ")", ")", 4, "obj-1", "bach.score", "end_preset" ]
						}
, 						{
							"number" : 2,
							"data" : [ 5, "obj-1", "bach.score", "begin_preset", 859, 256, "obj-1", "bach.score", "restore_preset", 0, 250, "score", "(", "slotinfo", "(", 1, "amplitude envelope", "function", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1080016896, 97, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 2, "slot function", "function", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 113, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 3, "slot longlist", "intlist", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1080016896, 119, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 4, "slot floatlist", "floatlist", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 101, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 5, "slot long", "int", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1080016896, 114, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 6, "slot float", "float", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 116, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 7, "slot text", "text", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 121, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 8, "filelist", "filelist", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 117, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 9, "spat", "spat", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1076101120, 105, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 10, "slot 10", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 11, "slot 11", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 12, "slot 12", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 13, "slot 13", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 14, "slot 14", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 15, "slot 15", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 256, "obj-1", "bach.score", "restore_preset", 250, 250, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 16, "slot 16", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 17, "slot 17", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 18, "slot 18", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 19, "slot 19", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 20, "slot 20", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 21, "slot 21", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 22, "slot 22", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 23, "slot 23", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 24, "slot 24", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 25, "slot 25", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 26, "slot 26", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 27, "slot 27", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 28, "slot 28", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 29, "slot 29", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 30, "slot 30", "none", 256, "obj-1", "bach.score", "restore_preset", 500, 250, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", ")", "(", "commands", "(", 1, "notecmd", "chordcmd", 0, ")", "(", 2, "notecmd", "chordcmd", 0, ")", "(", 3, "notecmd", "chordcmd", 0, ")", "(", 4, "notecmd", "chordcmd", 0, ")", "(", 5, "notecmd", "chordcmd", 0, ")", ")", "(", "clefs", "G", ")", "(", "keys", "CM", ")", "(", "midichannels", 1, ")", "(", "(", "(", "(", 4, 4, ")", "(", ")", ")", "(", "1/12", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1086147584, 127, 0, 0, ")", 0, ")", "(", "1/12", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1085865984, 127, 0, 0, ")", 0, ")", "(", "1/12", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1086045184, 127, 0, 0, ")", 0, ")", "(", "1/8", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1086070784, 127, 0, 0, ")", 0, ")", "(", "1/8", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1085891584, 127, 0, 0, ")", 0, ")", "(", "3/32", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1086301184, 127, 0, 0, ")", 0, ")", "(", "3/32", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1086301184, 127, 0, 0, ")", 0, ")", "(", "1/16", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1085993984, 127, 0, 0, ")", 0, ")", "(", "1/8", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1086338560, 127, 0, 0, ")", 0, ")", "(", "1/8", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1085942784, 127, 1, 0, ")", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1086249984, 127, 1, 0, ")", 0, ")", 0, ")", "(", "(", "(", 4, 4, ")", "(", ")", ")", "(", "1/4", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1085942784, 100, 0, 0, ")", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1086249984, 100, 0, 0, ")", 0, ")", "(", "1/12", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1086338560, 127, 0, 0, ")", 0, ")", "(", "1/6", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1086338560, 127, 0, 0, ")", 115, "obj-1", "bach.score", "restore_preset", 750, 109, 0, ")", "(", "1/6", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1086092726, 127, 0, 0, ")", 0, ")", "(", "1/12", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1085865984, 127, 1, 0, ")", 0, ")", "(", "1/28", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1085865984, 127, 0, 0, ")", 0, ")", "(", "1/28", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1085968384, 127, 0, 0, ")", 0, ")", "(", "1/28", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1086070784, 127, 0, 0, ")", 0, ")", "(", "1/28", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1085865984, 127, 0, 0, ")", 0, ")", "(", "1/14", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1085789184, 127, 0, 0, ")", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1085865984, 127, 0, 0, ")", 0, ")", "(", "1/28", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1085865984, 127, 0, 0, ")", 0, ")", 0, ")", ")", 4, "obj-1", "bach.score", "end_preset" ]
						}
, 						{
							"number" : 3,
							"data" : [ 5, "obj-1", "bach.score", "begin_preset", 859, 256, "obj-1", "bach.score", "restore_preset", 0, 250, "score", "(", "slotinfo", "(", 1, "amplitude envelope", "function", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1080016896, 97, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 2, "slot function", "function", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 113, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 3, "slot longlist", "intlist", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1080016896, 119, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 4, "slot floatlist", "floatlist", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 101, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 5, "slot long", "int", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1080016896, 114, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 6, "slot float", "float", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 116, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 7, "slot text", "text", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 121, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 8, "filelist", "filelist", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 117, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 9, "spat", "spat", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1076101120, 105, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 10, "slot 10", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 11, "slot 11", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 12, "slot 12", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 13, "slot 13", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 14, "slot 14", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 15, "slot 15", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 256, "obj-1", "bach.score", "restore_preset", 250, 250, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 16, "slot 16", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 17, "slot 17", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 18, "slot 18", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 19, "slot 19", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 20, "slot 20", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 21, "slot 21", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 22, "slot 22", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 23, "slot 23", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 24, "slot 24", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 25, "slot 25", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 26, "slot 26", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 27, "slot 27", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 28, "slot 28", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 29, "slot 29", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 30, "slot 30", "none", 256, "obj-1", "bach.score", "restore_preset", 500, 250, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", ")", "(", "commands", "(", 1, "notecmd", "chordcmd", 0, ")", "(", 2, "notecmd", "chordcmd", 0, ")", "(", 3, "notecmd", "chordcmd", 0, ")", "(", 4, "notecmd", "chordcmd", 0, ")", "(", 5, "notecmd", "chordcmd", 0, ")", ")", "(", "clefs", "G", ")", "(", "keys", "CM", ")", "(", "midichannels", 1, ")", "(", "(", "(", "(", 4, 4, ")", "(", ")", ")", "(", "1/12", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1086147584, 127, 0, 0, ")", 0, ")", "(", "1/12", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1085865984, 127, 0, 0, ")", 0, ")", "(", "1/12", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1086045184, 127, 0, 0, ")", 0, ")", "(", "1/8", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1086070784, 127, 0, 0, ")", 0, ")", "(", "1/8", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1085891584, 127, 0, 0, ")", 0, ")", "(", "3/16", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1086301184, 127, 0, 0, ")", 0, ")", "(", "1/16", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1085993984, 127, 0, 0, ")", 0, ")", "(", "1/8", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1086096384, 127, 0, 0, ")", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1086338560, 127, 0, 0, ")", 0, ")", "(", "1/8", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1085942784, 127, 0, 0, ")", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1086338560, 127, 1, 0, ")", 0, ")", 0, ")", "(", "(", "(", 4, 4, ")", "(", ")", ")", "(", "1/4", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1086338560, 127, 1, 0, ")", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1086415360, 127, 0, 0, ")", 0, ")", "(", "1/12", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1086338560, 127, 0, 0, ")", 0, ")", "(", "1/6", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1086338560, 127, 0, 0, ")", 0, ")", "(", "1/6", 115, "obj-1", "bach.score", "restore_preset", 750, 109, "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1086092726, 127, 0, 0, ")", 0, ")", "(", "1/12", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1085865984, 127, 1, 0, ")", 0, ")", "(", "1/28", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1085865984, 127, 0, 0, ")", 0, ")", "(", "1/28", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1085968384, 127, 0, 0, ")", 0, ")", "(", "1/28", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1085865984, 127, 0, 0, ")", 0, ")", "(", "1/28", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1085865984, 127, 0, 0, ")", 0, ")", "(", "1/28", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1085789184, 127, 0, 0, ")", 0, ")", "(", "1/28", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1085865984, 127, 0, 0, ")", 0, ")", "(", "1/28", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1085865984, 127, 0, 0, ")", 0, ")", 0, ")", ")", 4, "obj-1", "bach.score", "end_preset" ]
						}
, 						{
							"number" : 4,
							"data" : [ 5, "obj-1", "bach.score", "begin_preset", 795, 256, "obj-1", "bach.score", "restore_preset", 0, 250, "score", "(", "slotinfo", "(", 1, "amplitude envelope", "function", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1080016896, 97, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 2, "slot function", "function", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 113, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 3, "slot longlist", "intlist", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1080016896, 119, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 4, "slot floatlist", "floatlist", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 101, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 5, "slot long", "int", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1080016896, 114, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 6, "slot float", "float", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 116, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 7, "slot text", "text", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 121, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 8, "filelist", "filelist", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 117, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 9, "spat", "spat", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1076101120, 105, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 10, "slot 10", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 11, "slot 11", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 12, "slot 12", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 13, "slot 13", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 14, "slot 14", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 15, "slot 15", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 256, "obj-1", "bach.score", "restore_preset", 250, 250, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 16, "slot 16", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 17, "slot 17", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 18, "slot 18", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 19, "slot 19", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 20, "slot 20", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 21, "slot 21", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 22, "slot 22", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 23, "slot 23", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 24, "slot 24", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 25, "slot 25", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 26, "slot 26", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 27, "slot 27", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 28, "slot 28", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 29, "slot 29", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 30, "slot 30", "none", 256, "obj-1", "bach.score", "restore_preset", 500, 250, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", ")", "(", "commands", "(", 1, "notecmd", "chordcmd", 0, ")", "(", 2, "notecmd", "chordcmd", 0, ")", "(", 3, "notecmd", "chordcmd", 0, ")", "(", 4, "notecmd", "chordcmd", 0, ")", "(", 5, "notecmd", "chordcmd", 0, ")", ")", "(", "clefs", "G", ")", "(", "keys", "CM", ")", "(", "midichannels", 1, ")", "(", "(", "(", "(", 4, 4, ")", "(", ")", ")", "(", "1/12", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1086147584, 127, 0, 0, ")", 0, ")", "(", "1/12", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1085865984, 127, 0, 0, ")", 0, ")", "(", "1/12", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1086045184, 127, 0, 0, ")", 0, ")", "(", "1/8", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1086070784, 127, 0, 0, ")", 0, ")", "(", "1/8", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1086147584, 127, 1, 0, ")", 0, ")", "(", "3/16", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 21845, 1086156117, 100, 0, 0, ")", 0, ")", "(", "1/16", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1085993984, 127, 0, 0, ")", 0, ")", "(", "1/8", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1086096384, 127, 0, 0, ")", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1086338560, 127, 0, 0, ")", 0, ")", "(", "1/8", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1085942784, 127, 0, 0, ")", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1086338560, 127, 0, 0, ")", 0, ")", 0, ")", "(", "(", "(", 4, 4, ")", "(", ")", ")", "(", "3/8", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1086045184, 127, 0, 0, ")", 0, ")", "(", "1/8", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1086147584, 127, 1, 0, ")", 0, ")", "(", "3/16", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 21845, 1086156117, 100, 0, 0, ")", 0, ")", "(", "1/16", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1085993984, 127, 0, 0, ")", 51, "obj-1", "bach.score", "restore_preset", 750, 45, 0, ")", "(", "1/8", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1086096384, 127, 0, 0, ")", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1086338560, 127, 0, 0, ")", 0, ")", "(", "1/8", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1085942784, 127, 0, 0, ")", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1086351360, 127, 0, 0, ")", 0, ")", 0, ")", ")", 4, "obj-1", "bach.score", "end_preset" ]
						}
, 						{
							"number" : 5,
							"data" : [ 5, "obj-1", "bach.score", "begin_preset", 688, 256, "obj-1", "bach.score", "restore_preset", 0, 250, "score", "(", "slotinfo", "(", 1, "amplitude envelope", "function", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1080016896, 97, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 2, "slot function", "function", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 113, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 3, "slot longlist", "intlist", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1080016896, 119, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 4, "slot floatlist", "floatlist", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 101, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 5, "slot long", "int", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1080016896, 114, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 6, "slot float", "float", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 116, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 7, "slot text", "text", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 121, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 8, "filelist", "filelist", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 117, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 9, "spat", "spat", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1076101120, 105, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 10, "slot 10", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 11, "slot 11", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 12, "slot 12", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 13, "slot 13", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 14, "slot 14", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 15, "slot 15", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 256, "obj-1", "bach.score", "restore_preset", 250, 250, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 16, "slot 16", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 17, "slot 17", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 18, "slot 18", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 19, "slot 19", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 20, "slot 20", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 21, "slot 21", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 22, "slot 22", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 23, "slot 23", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 24, "slot 24", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 25, "slot 25", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 26, "slot 26", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 27, "slot 27", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 28, "slot 28", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 29, "slot 29", "none", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", "(", 30, "slot 30", "none", 194, "obj-1", "bach.score", "restore_preset", 500, 188, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1072693248, 0, "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 0, "(", ")", ")", ")", "(", "commands", "(", 1, "notecmd", "chordcmd", 0, ")", "(", 2, "notecmd", "chordcmd", 0, ")", "(", 3, "notecmd", "chordcmd", 0, ")", "(", 4, "notecmd", "chordcmd", 0, ")", "(", 5, "notecmd", "chordcmd", 0, ")", ")", "(", "clefs", "G", ")", "(", "keys", "CM", ")", "(", "midichannels", 1, ")", "(", "(", "(", "(", 4, 4, ")", "(", ")", ")", "(", "1/12", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1086147584, 127, 0, 0, ")", 0, ")", "(", "1/12", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1085865984, 127, 0, 0, ")", 0, ")", "(", "1/12", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1086045184, 127, 0, 0, ")", 0, ")", "(", "1/8", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1086070784, 127, 0, 0, ")", 0, ")", "(", "1/8", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1085891584, 127, 0, 0, ")", 0, ")", "(", "-3/16", 0, ")", "(", "1/16", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1085993984, 127, 0, 0, ")", 0, ")", "(", "1/8", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1086096384, 127, 0, 0, ")", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1086338560, 127, 0, 0, ")", 0, ")", "(", "1/8", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1085942784, 127, 0, 0, ")", "(", "ˇˇˇˇ_float64_ˇˇˇˇ", 0, 1086338560, 127, 0, 0, ")", 0, ")", 0, ")", ")", 4, "obj-1", "bach.score", "end_preset" ]
						}
 ]
				}

			}
, 			{
				"box" : 				{
					"fontname" : "Arial",
					"fontsize" : 12.0,
					"hidden" : 1,
					"id" : "obj-78",
					"maxclass" : "newobj",
					"numinlets" : 1,
					"numoutlets" : 1,
					"outlettype" : [ "" ],
					"patching_rect" : [ -76.0, 372.0, 91.0, 22.0 ],
					"text" : "loadmess clear"
				}

			}
, 			{
				"box" : 				{
					"fontname" : "Arial",
					"fontsize" : 12.0,
					"id" : "obj-43",
					"linecount" : 2,
					"maxclass" : "comment",
					"numinlets" : 1,
					"numoutlets" : 0,
					"patching_rect" : [ 10.0, 495.0, 804.0, 33.0 ],
					"text" : "Beware: we chose [bach.rev 2] (which is: @maxdepth 2) since we didn't care about reversing the first level (we had just one voice) and we wanted to reverse the second level (the chord-level), but we definitely didn't need to reverse the order of the notes in the chord (third level). Thus 2 levels suffice!"
				}

			}
, 			{
				"box" : 				{
					"fontname" : "Arial",
					"fontsize" : 12.0,
					"hidden" : 1,
					"id" : "obj-38",
					"maxclass" : "newobj",
					"numinlets" : 1,
					"numoutlets" : 1,
					"outlettype" : [ "bang" ],
					"patching_rect" : [ -239.0, 38.0, 60.0, 22.0 ],
					"text" : "loadbang"
				}

			}
, 			{
				"box" : 				{
					"fontname" : "Arial",
					"fontsize" : 12.0,
					"hidden" : 1,
					"id" : "obj-37",
					"linecount" : 13,
					"maxclass" : "message",
					"numinlets" : 2,
					"numoutlets" : 1,
					"outlettype" : [ "" ],
					"patching_rect" : [ -387.0, 85.0, 295.0, 183.0 ],
					"text" : "score [ [ [ [ 4 4 ] [ ] ] [ 1/12 [ 7500. 127 0 0 ] 0 ] [ 1/12 [ 6400. 127 0 0 ] 0 ] [ 1/12 [ 7100. 127 0 0 ] 0 ] [ 1/8 [ 7200. 127 0 0 ] 0 ] [ 1/8 [ 6500. 127 0 0 ] 0 ] [ 3/16 [ 8100. 127 0 0 ] 0 ] [ 1/16 [ 6900. 127 0 0 ] 0 ] [ 1/8 [ 7300. 127 0 0 ) ( 8300. 127 0 0 ) 0 ) ( 1/8 ( 6700. 127 0 0 ) ( 8300. 127 1 0 ) 0 ) 0 ) ( ( ( 4 4 ) ( ) ) ( 1/4 ( 8300. 127 1 0 ) ( 8900. 127 0 0 ) 0 ) ( 1/12 ( 8300. 127 0 0 ) 0 ) ( 1/6 ( 8300. 127 0 0 ) 0 ) ( 1/6 ( 7285.710938 127 0 0 ) 0 ) ( 1/12 ( 6400. 127 1 0 ) 0 ) ( 1/28 ( 6400. 127 0 0 ) 0 ) ( 1/28 ( 6800. 127 0 0 ) 0 ) ( 1/28 ( 6400. 127 0 0 ) 0 ) ( 1/28 ( 6400. 127 0 0 ) 0 ) ( 1/28 ( 6100. 127 0 0 ) 0 ) ( 1/28 ( 6400. 127 0 0 ) 0 ) ( 1/28 ( 6400. 127 0 0 ) 0 ) 0 ) )"
				}

			}
, 			{
				"box" : 				{
					"fontname" : "Arial",
					"fontsize" : 12.0,
					"id" : "obj-44",
					"linecount" : 2,
					"maxclass" : "comment",
					"numinlets" : 1,
					"numoutlets" : 0,
					"patching_rect" : [ 549.0, 273.0, 235.0, 33.0 ],
					"text" : "this is only needed if you have non-completely-tied chords:"
				}

			}
, 			{
				"box" : 				{
					"fontname" : "Arial",
					"fontsize" : 12.0,
					"id" : "obj-42",
					"maxclass" : "comment",
					"numinlets" : 1,
					"numoutlets" : 0,
					"patching_rect" : [ 523.0, 279.0, 35.0, 20.0 ],
					"text" : "<<< "
				}

			}
, 			{
				"box" : 				{
					"fontname" : "Arial",
					"fontsize" : 12.0,
					"id" : "obj-40",
					"maxclass" : "newobj",
					"numinlets" : 2,
					"numoutlets" : 1,
					"outlettype" : [ "" ],
					"patching_rect" : [ 462.0, 302.0, 69.0, 22.0 ],
					"text" : "bach.tierev"
				}

			}
, 			{
				"box" : 				{
					"fontname" : "Arial",
					"fontsize" : 12.0,
					"id" : "obj-39",
					"maxclass" : "newobj",
					"numinlets" : 2,
					"numoutlets" : 2,
					"outlettype" : [ "", "" ],
					"patching_rect" : [ 330.0, 265.0, 44.0, 22.0 ],
					"text" : "gate 2"
				}

			}
, 			{
				"box" : 				{
					"fontname" : "Arial",
					"fontsize" : 12.0,
					"id" : "obj-33",
					"maxclass" : "newobj",
					"numinlets" : 1,
					"numoutlets" : 1,
					"outlettype" : [ "" ],
					"patching_rect" : [ 355.0, 302.0, 67.0, 22.0 ],
					"saved_object_attributes" : 					{
						"versionnumber" : 80100
					}
,
					"text" : "bach.rev 2"
				}

			}
, 			{
				"box" : 				{
					"fontname" : "Arial",
					"fontsize" : 12.0,
					"id" : "obj-14",
					"linecount" : 5,
					"maxclass" : "comment",
					"numinlets" : 1,
					"numoutlets" : 0,
					"patching_rect" : [ 549.0, 310.0, 288.0, 74.0 ],
					"text" : "we need to beat-box the new data, in order to have the measure-wise syntax needed by score. The object in charge for it is [bach.beatbox], and you only need to link it to score's first inlet (or... try to set a \"separate\" symbol as attribute!!!)"
				}

			}
, 			{
				"box" : 				{
					"fontname" : "Arial",
					"fontsize" : 12.0,
					"id" : "obj-12",
					"linecount" : 3,
					"maxclass" : "comment",
					"numinlets" : 1,
					"numoutlets" : 0,
					"patching_rect" : [ 552.0, 213.0, 288.0, 47.0 ],
					"text" : "all the parameters are beat-unboxed: from a measure-wise syntax, we get a plain flux of notes (all tied notes are gathered, all rests are merged)"
				}

			}
, 			{
				"box" : 				{
					"fontname" : "Arial",
					"fontsize" : 12.0,
					"hidden" : 1,
					"id" : "obj-17",
					"maxclass" : "newobj",
					"numinlets" : 1,
					"numoutlets" : 1,
					"outlettype" : [ "" ],
					"patching_rect" : [ 2.0, 288.0, 72.0, 22.0 ],
					"text" : "loadmess 1"
				}

			}
, 			{
				"box" : 				{
					"fontname" : "Arial",
					"fontsize" : 12.0,
					"id" : "obj-15",
					"maxclass" : "newobj",
					"numinlets" : 2,
					"numoutlets" : 1,
					"outlettype" : [ "int" ],
					"patching_rect" : [ 4.0, 254.0, 32.5, 22.0 ],
					"text" : "+ 1"
				}

			}
, 			{
				"box" : 				{
					"allowdrag" : 0,
					"fontname" : "Arial",
					"fontsize" : 12.0,
					"id" : "obj-10",
					"items" : [ "Don't", "reverse", "pitches", ",", "Reverse", "pitches", "as", "well" ],
					"maxclass" : "umenu",
					"numinlets" : 1,
					"numoutlets" : 3,
					"outlettype" : [ "int", "", "" ],
					"parameter_enable" : 0,
					"patching_rect" : [ 4.0, 228.0, 160.0, 22.0 ]
				}

			}
, 			{
				"box" : 				{
					"fontname" : "Arial",
					"fontsize" : 12.0,
					"id" : "obj-9",
					"maxclass" : "newobj",
					"numinlets" : 2,
					"numoutlets" : 2,
					"outlettype" : [ "", "" ],
					"patching_rect" : [ 155.0, 265.0, 44.0, 22.0 ],
					"text" : "gate 2"
				}

			}
, 			{
				"box" : 				{
					"fontname" : "Arial",
					"fontsize" : 12.0,
					"id" : "obj-7",
					"maxclass" : "newobj",
					"numinlets" : 1,
					"numoutlets" : 1,
					"outlettype" : [ "" ],
					"patching_rect" : [ 180.0, 302.0, 67.0, 22.0 ],
					"saved_object_attributes" : 					{
						"versionnumber" : 80100
					}
,
					"text" : "bach.rev 2"
				}

			}
, 			{
				"box" : 				{
					"fontname" : "Arial",
					"fontsize" : 12.0,
					"id" : "obj-8",
					"maxclass" : "message",
					"numinlets" : 2,
					"numoutlets" : 1,
					"outlettype" : [ "" ],
					"patching_rect" : [ 4.0, 78.0, 41.0, 22.0 ],
					"text" : "dump"
				}

			}
, 			{
				"box" : 				{
					"fontname" : "Arial",
					"fontsize" : 12.0,
					"id" : "obj-2",
					"maxclass" : "newobj",
					"numinlets" : 1,
					"numoutlets" : 1,
					"outlettype" : [ "" ],
					"patching_rect" : [ 267.399993999999992, 302.0, 57.0, 22.0 ],
					"saved_object_attributes" : 					{
						"versionnumber" : 80100
					}
,
					"text" : "bach.rev"
				}

			}
, 			{
				"box" : 				{
					"fontname" : "Arial",
					"fontsize" : 12.0,
					"id" : "obj-11",
					"maxclass" : "newobj",
					"numinlets" : 6,
					"numoutlets" : 1,
					"outlettype" : [ "" ],
					"patching_rect" : [ 92.0, 330.0, 457.0, 22.0 ],
					"saved_object_attributes" : 					{
						"versionnumber" : 80100
					}
,
					"text" : "bach.beatbox"
				}

			}
, 			{
				"box" : 				{
					"fontname" : "Arial",
					"fontsize" : 12.0,
					"id" : "obj-3",
					"maxclass" : "newobj",
					"numinlets" : 1,
					"numoutlets" : 6,
					"outlettype" : [ "", "", "", "", "", "" ],
					"patching_rect" : [ 92.0, 203.0, 457.5, 22.0 ],
					"saved_object_attributes" : 					{
						"versionnumber" : 80100
					}
,
					"text" : "bach.beatunbox @merge 2"
				}

			}
, 			{
				"box" : 				{
					"fontname" : "Arial",
					"fontsize" : 12.0,
					"id" : "obj-16",
					"linecount" : 2,
					"maxclass" : "comment",
					"numinlets" : 1,
					"numoutlets" : 0,
					"patching_rect" : [ 2.0, 39.0, 810.0, 33.0 ],
					"text" : "To achieve this, you need to have a plain list of durations. Somehow, you don't want to have \"tied\" notes, you want to consider them in their entirety, discarding measures and ties:"
				}

			}
, 			{
				"box" : 				{
					"bwcompatibility" : 80100,
					"constraintbeamsinspaces" : 0,
					"defaultnoteslots" : [ "null" ],
					"fontface" : 0,
					"fontname" : "Arial",
					"fontsize" : 12.0,
					"id" : "obj-5",
					"linkannotationtoslot" : 0,
					"linkarticulationstoslot" : 0,
					"linkdynamicstoslot" : 0,
					"linklyricstoslot" : 7,
					"loop" : [ "[", 1, 1, 0, "]", "[", 1, 1, 0, "]" ],
					"maxclass" : "bach.score",
					"numinlets" : 7,
					"numoutlets" : 9,
					"numvoices" : 1,
					"out" : "nnnnnnnn",
					"outlettype" : [ "", "", "", "", "", "", "", "", "bang" ],
					"patching_rect" : [ 10.0, 383.0, 721.0, 110.0 ],
					"pitcheditrange" : [ "null" ],
					"stafflines" : [ 5 ],
					"textcolor" : [ 0.0, 0.0, 0.0, 1.0 ],
					"versionnumber" : 80100,
					"voicenames" : [ "[", "]" ],
					"voicespacing" : [ 0.0, 26.0 ],
					"whole_score_data_0000000000" : [ "score", "[", "slotinfo", "[", 1, "[", "name", "amplitude envelope", "]", "[", "type", "function", "]", "[", "key", "a", "]", "[", "range", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 0, "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1080016896, "]", "[", "slope", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 0, "]", "[", "representation", "]", "[", "grid", "]", "[", "ysnap", "]", "[", "domain", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 0, "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1072693248, "]", "[", "domainslope", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 0, "]", "[", "temporalmode", "relative", "]", "[", "extend", 0, "]", "[", "width", "duration", "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 0, "]", "[", "access", "readandwrite", "]", "]", "[", 2, "[", "name", "slot function", "]", "[", "type", "function", "]", "[", "key", "q", "]", "[", "range", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 0, "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1072693248, "]", "[", "slope", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 0, "]", "[", "representation", "]", "[", "grid", "]", "[", "ysnap", "]", "[", "domain", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 0, "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1072693248, "]", "[", "domainslope", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 0, "]", "[", "temporalmode", "relative", "]", "[", "extend", 0, "]", "[", "width", "duration", "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 0, "]", "[", "access", "readandwrite", "]", "]", "[", 3, "[", "name", "slot longlist", "]", "[", "type", "intlist", "]", "[", "key", "w", "]", "[", "range", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 0, "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1080016896, "]", "[", "slope", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 0, "]", "[", "representation", "]", "[", "default", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1078984704, "]", "[", "temporalmode", "none", "]", "[", "extend", 0, "]", "[", "width", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1079574528, "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 1, "]", "[", "access", "readandwrite", "]", "]", "[", 4, "[", "name", "slot floatlist", "]", "[", "type", "floatlist", "]", "[", "key", "e", "]", "[", "range", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 0, "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1072693248, "]", "[", "slope", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 0, "]", "[", "representation", "]", "[", "default", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 0, "]", "[", "temporalmode", "none", "]", "[", "extend", 0, "]", "[", "width", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1079574528, "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 1, "]", "[", "access", "readandwrite", "]", "]", "[", 5, "[", "name", "slot long", "]", "[", "type", "int", "]", "[", "key", "r", "]", "[", "range", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 0, "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1080016896, "]", "[", "slope", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 0, "]", "[", "representation", "]", "[", "default", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1078984704, "]", "[", "temporalmode", "none", "]", "[", "extend", 0, "]", "[", "width", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1079574528, "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 1, "]", "[", "access", "readandwrite", "]", "]", "[", 6, "[", "name", "slot float", "]", "[", "type", "float", "]", "[", "key", "t", "]", "[", "range", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 0, "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1072693248, "]", "[", "slope", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 0, "]", "[", "representation", "]", "[", "default", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 0, "]", "[", "temporalmode", "none", "]", "[", "extend", 0, "]", "[", "width", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1079574528, "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 1, "]", "[", "access", "readandwrite", "]", "]", "[", 7, "[", "name", "slot text", "]", "[", "type", "text", "]", "[", "key", "y", "]", "[", "temporalmode", "none", "]", "[", "extend", 0, "]", "[", "width", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1079574528, "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 0, "]", "[", "access", "readandwrite", "]", "]", "[", 8, "[", "name", "filelist", "]", "[", "type", "filelist", "]", "[", "key", "u", "]", "[", "temporalmode", "none", "]", "[", "extend", 0, "]", "[", "width", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1080213504, "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 1, "]", "[", "access", "readandwrite", "]", "]", "[", 9, "[", "name", "spat", "]", "[", "type", "spat", "]", "[", "key", "i", "]", "[", "range", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 0, "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1076101120, "]", "[", "slope", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 0, "]", "[", "representation", "]", "[", "temporalmode", "relative", "]", "[", "extend", 0, "]", "[", "width", "duration", "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 0, "]", "[", "access", "readandwrite", "]", "]", "[", 10, "[", "name", "slot 10", "]", "[", "type", "none", "]", "[", "key", 0, "]", "[", "temporalmode", "none", "]", "[", "extend", 0, "]", "[", "width", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1079574528, "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 0, "]", "[", "access", "readandwrite", "]", "]", "[", 11, "[", "name", "slot 11", "]", "[", "type", "none", "]", "[", "key", 0, "]", "[", "temporalmode", "none", "]", "[", "extend", 0, "]", "[", "width", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1079574528, "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 1, "]", "[", "access", "readandwrite", "]", "]", "[", 12, "[", "name", "slot 12", "]", "[", "type", "none", "]", "[", "key", 0, "]", "[", "temporalmode", "none", "]", "[", "extend", 0, "]", "[", "width", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1079574528, "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 1, "]", "[", "access", "readandwrite", "]", "]", "[", 13, "[", "name", "slot 13", "]", "[", "type", "none", "]", "[", "key", 0, "]", "[", "temporalmode", "none", "]", "[", "extend", 0, "]", "[", "width", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1079574528, "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 1, "]", "[", "access", "readandwrite", "]", "]", "[", 14, "[", "name", "slot 14", "]", "[", "type", "none", "]", "[", "key", 0, "]", "[", "temporalmode", "none", "]", "[", "extend", 0, "]", "[", "width", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1079574528, "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 1, "]", "[", "access", "readandwrite", "]", "]", "[", 15, "[", "name", "slot 15", "]", "[", "type", "none", "]", "[", "key", 0, "]", "[", "temporalmode", "none", "]", "[", "extend", 0, "]", "[", "width", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1079574528, "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 1, "]", "[", "access", "readandwrite", "]", "]", "[", 16, "[", "name", "slot 16", "]", "[", "type", "none", "]", "[", "key", 0, "]", "[", "temporalmode", "none", "]", "[", "extend", 0, "]", "[", "width", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1079574528, "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 1, "]", "[", "access", "readandwrite", "]", "]", "[", 17, "[", "name", "slot 17", "]", "[", "type", "none", "]", "[", "key", 0, "]", "[", "temporalmode", "none", "]", "[", "extend", 0, "]", "[", "width", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1079574528, "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 1, "]", "[", "access", "readandwrite", "]", "]", "[", 18, "[", "name", "slot 18", "]", "[", "type", "none", "]", "[", "key", 0, "]", "[", "temporalmode", "none", "]", "[", "extend", 0, "]", "[", "width", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1079574528, "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 1, "]", "[", "access", "readandwrite", "]", "]", "[", 19, "[", "name", "slot 19", "]", "[", "type", "none", "]", "[", "key", 0, "]", "[", "temporalmode", "none", "]", "[", "extend", 0, "]", "[", "width", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1079574528, "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 1, "]", "[", "access", "readandwrite", "]", "]", "[", 20, "[", "name", "slot 20", "]", "[", "type", "none", "]", "[", "key", 0, "]", "[", "temporalmode", "none", "]", "[", "extend", 0, "]", "[", "width", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1079574528, "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 0, "]", "[", "access", "readandwrite", "]", "]", "[", 21, "[", "name", "slot 21", "]", "[", "type", "none", "]", "[", "key", 0, "]", "[", "temporalmode", "none", "]", "[", "extend", 0, "]", "[", "width", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1079574528, "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 0, "]", "[", "access", "readandwrite", "]", "]", "[", 22, "[", "name", "slot 22", "]", "[", "type", "none", "]", "[", "key", 0, "]", "[", "temporalmode", "none", "]", "[", "extend", 0, "]", "[", "width", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1079574528, "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 1, "]", "[", "access", "readandwrite", "]", "]", "[", 23, "[", "name", "slot 23", "]", "[", "type", "none", "]", "[", "key", 0, "]", "[", "temporalmode", "none", "]", "[", "extend", 0, "]", "[", "width", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1079574528, "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 1, "]", "[", "access", "readandwrite", "]", "]", "[", 24, "[", "name", "slot 24", "]", "[", "type", "none", "]", "[", "key", 0, "]", "[", "temporalmode", "none", "]", "[", "extend", 0, "]", "[", "width", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1079574528, "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 1, "]", "[", "access", "readandwrite", "]", "]", "[", 25, "[", "name", "slot 25", "]", "[", "type", "none", "]", "[", "key", 0, "]", "[", "temporalmode", "none", "]", "[", "extend", 0, "]", "[", "width", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1079574528, "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 1, "]", "[", "access", "readandwrite", "]", "]", "[", 26, "[", "name", "slot 26", "]", "[", "type", "none", "]", "[", "key", 0, "]", "[", "temporalmode", "none", "]", "[", "extend", 0, "]", "[", "width", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1079574528, "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 1, "]", "[", "access", "readandwrite", "]", "]", "[", 27, "[", "name", "slot 27", "]", "[", "type", "none", "]", "[", "key", 0, "]", "[", "temporalmode", "none", "]", "[", "extend", 0, "]", "[", "width", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1079574528, "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 1, "]", "[", "access", "readandwrite", "]", "]", "[", 28, "[", "name", "slot 28", "]", "[", "type", "none", "]", "[", "key", 0, "]", "[", "temporalmode", "none", "]", "[", "extend", 0, "]", "[", "width", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1079574528, "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 1, "]", "[", "access", "readandwrite", "]", "]", "[", 29, "[", "name", "slot 29", "]", "[", "type", "none", "]", "[", "key", 0, "]", "[", "temporalmode", "none", "]", "[", "extend", 0, "]", "[", "width", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1079574528, "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 1, "]", "[", "access", "readandwrite", "]", "]", "[", 30, "[", "name", "slot 30", "]", "[", "type", "none", "]", "[", "key", 0, "]", "[", "temporalmode", "none", "]", "[", "extend", 0, "]", "[", "width", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1079574528, "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 1, "]", "[", "access", "readandwrite", "]", "]", "]", "[", "commands", "[", 1, "[", "note", "notecmd", "]", "[", "chord", "chordcmd", "]", "[", "rest", "rest", "]", "[", "key", 0, "]", "]", "[", 2, "[", "note", "notecmd", "]", "[", "chord", "chordcmd", "]", "[", "rest", "rest", "]", "[", "key", 0, "]", "]", "[", 3, "[", "note", "notecmd", "]", "[", "chord", "chordcmd", "]", "[", "rest", "rest", "]", "[", "key", 0, "]", "]", "[", 4, "[", "note", "notecmd", "]", "[", "chord", "chordcmd", "]", "[", "rest", "rest", "]", "[", "key", 0, "]", "]", "[", 5, "[", "note", "notecmd", "]", "[", "chord", "chordcmd", "]", "[", "rest", "rest", "]", "[", "key", 0, "]", "]", "]", "[", "markers", "]", "[", "midichannels", 1, "]", "[", "articulationinfo", "]", "[", "noteheadinfo", "]", "[", 0, "]" ],
					"whole_score_data_count" : [ 1 ]
				}

			}
, 			{
				"box" : 				{
					"bwcompatibility" : 80100,
					"constraintbeamsinspaces" : 0,
					"defaultnoteslots" : [ "null" ],
					"fontface" : 0,
					"fontname" : "Arial",
					"fontsize" : 12.0,
					"id" : "obj-1",
					"linkannotationtoslot" : 0,
					"linkarticulationstoslot" : 0,
					"linkdynamicstoslot" : 0,
					"linklyricstoslot" : 7,
					"loop" : [ "[", 1, 1, 0, "]", "[", 1, 1, 0, "]" ],
					"maxclass" : "bach.score",
					"numinlets" : 7,
					"numoutlets" : 9,
					"numvoices" : 1,
					"out" : "nnnnnnnn",
					"outlettype" : [ "", "", "", "", "", "", "", "", "bang" ],
					"patching_rect" : [ 4.0, 98.0, 721.0, 97.0 ],
					"pitcheditrange" : [ "null" ],
					"stafflines" : [ 5 ],
					"textcolor" : [ 0.0, 0.0, 0.0, 1.0 ],
					"versionnumber" : 80100,
					"voicenames" : [ "[", "]" ],
					"voicespacing" : [ 0.0, 13.0 ],
					"whole_score_data_0000000000" : [ "score", "[", "slotinfo", "[", 1, "[", "name", "amplitude envelope", "]", "[", "type", "function", "]", "[", "key", "a", "]", "[", "range", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 0, "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1080016896, "]", "[", "slope", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 0, "]", "[", "representation", "]", "[", "grid", "]", "[", "ysnap", "]", "[", "domain", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 0, "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1072693248, "]", "[", "domainslope", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 0, "]", "[", "temporalmode", "relative", "]", "[", "extend", 0, "]", "[", "width", "duration", "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 0, "]", "[", "access", "readandwrite", "]", "]", "[", 2, "[", "name", "slot function", "]", "[", "type", "function", "]", "[", "key", "q", "]", "[", "range", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 0, "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1072693248, "]", "[", "slope", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 0, "]", "[", "representation", "]", "[", "grid", "]", "[", "ysnap", "]", "[", "domain", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 0, "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1072693248, "]", "[", "domainslope", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 0, "]", "[", "temporalmode", "relative", "]", "[", "extend", 0, "]", "[", "width", "duration", "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 0, "]", "[", "access", "readandwrite", "]", "]", "[", 3, "[", "name", "slot longlist", "]", "[", "type", "intlist", "]", "[", "key", "w", "]", "[", "range", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 0, "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1080016896, "]", "[", "slope", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 0, "]", "[", "representation", "]", "[", "default", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1078984704, "]", "[", "temporalmode", "none", "]", "[", "extend", 0, "]", "[", "width", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1079574528, "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 1, "]", "[", "access", "readandwrite", "]", "]", "[", 4, "[", "name", "slot floatlist", "]", "[", "type", "floatlist", "]", "[", "key", "e", "]", "[", "range", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 0, "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1072693248, "]", "[", "slope", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 0, "]", "[", "representation", "]", "[", "default", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 0, "]", "[", "temporalmode", "none", "]", "[", "extend", 0, "]", "[", "width", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1079574528, "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 1, "]", "[", "access", "readandwrite", "]", "]", "[", 5, "[", "name", "slot long", "]", "[", "type", "int", "]", "[", "key", "r", "]", "[", "range", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 0, "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1080016896, "]", "[", "slope", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 0, "]", "[", "representation", "]", "[", "default", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1078984704, "]", "[", "temporalmode", "none", "]", "[", "extend", 0, "]", "[", "width", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1079574528, "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 1, "]", "[", "access", "readandwrite", "]", "]", "[", 6, "[", "name", "slot float", "]", "[", "type", "float", "]", "[", "key", "t", "]", "[", "range", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 0, "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1072693248, "]", "[", "slope", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 0, "]", "[", "representation", "]", "[", "default", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 0, "]", "[", "temporalmode", "none", "]", "[", "extend", 0, "]", "[", "width", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1079574528, "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 1, "]", "[", "access", "readandwrite", "]", "]", "[", 7, "[", "name", "slot text", "]", "[", "type", "text", "]", "[", "key", "y", "]", "[", "temporalmode", "none", "]", "[", "extend", 0, "]", "[", "width", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1079574528, "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 0, "]", "[", "access", "readandwrite", "]", "]", "[", 8, "[", "name", "filelist", "]", "[", "type", "filelist", "]", "[", "key", "u", "]", "[", "temporalmode", "none", "]", "[", "extend", 0, "]", "[", "width", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1080213504, "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 1, "]", "[", "access", "readandwrite", "]", "]", "[", 9, "[", "name", "spat", "]", "[", "type", "spat", "]", "[", "key", "i", "]", "[", "range", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 0, "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1076101120, "]", "[", "slope", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 0, "]", "[", "representation", "]", "[", "temporalmode", "relative", "]", "[", "extend", 0, "]", "[", "width", "duration", "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 0, "]", "[", "access", "readandwrite", "]", "]", "[", 10, "[", "name", "slot 10", "]", "[", "type", "none", "]", "[", "key", 0, "]", "[", "temporalmode", "none", "]", "[", "extend", 0, "]", "[", "width", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1079574528, "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 0, "]", "[", "access", "readandwrite", "]", "]", "[", 11, "[", "name", "slot 11", "]", "[", "type", "none", "]", "[", "key", 0, "]", "[", "temporalmode", "none", "]", "[", "extend", 0, "]", "[", "width", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1079574528, "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 1, "]", "[", "access", "readandwrite", "]", "]", "[", 12, "[", "name", "slot 12", "]", "[", "type", "none", "]", "[", "key", 0, "]", "[", "temporalmode", "none", "]", "[", "extend", 0, "]", "[", "width", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1079574528, "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 1, "]", "[", "access", "readandwrite", "]", "]", "[", 13, "[", "name", "slot 13", "]", "[", "type", "none", "]", "[", "key", 0, "]", "[", "temporalmode", "none", "]", "[", "extend", 0, "]", "[", "width", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1079574528, "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 1, "]", "[", "access", "readandwrite", "]", "]", "[", 14, "[", "name", "slot 14", "]", "[", "type", "none", "]", "[", "key", 0, "]", "[", "temporalmode", "none", "]", "[", "extend", 0, "]", "[", "width", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1079574528, "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 1, "]", "[", "access", "readandwrite", "]", "]", "[", 15, "[", "name", "slot 15", "]", "[", "type", "none", "]", "[", "key", 0, "]", "[", "temporalmode", "none", "]", "[", "extend", 0, "]", "[", "width", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1079574528, "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 1, "]", "[", "access", "readandwrite", "]", "]", "[", 16, "[", "name", "slot 16", "]", "[", "type", "none", "]", "[", "key", 0, "]", "[", "temporalmode", "none", "]", "[", "extend", 0, "]", "[", "width", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1079574528, "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 1, "]", "[", "access", "readandwrite", "]", "]", "[", 17, "[", "name", "slot 17", "]", "[", "type", "none", "]", "[", "key", 0, "]", "[", "temporalmode", "none", "]", "[", "extend", 0, "]", "[", "width", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1079574528, "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 1, "]", "[", "access", "readandwrite", "]", "]", "[", 18, "[", "name", "slot 18", "]", "[", "type", "none", "]", "[", "key", 0, "]", "[", "temporalmode", "none", "]", "[", "extend", 0, "]", "[", "width", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1079574528, "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 1, "]", "[", "access", "readandwrite", "]", "]", "[", 19, "[", "name", "slot 19", "]", "[", "type", "none", "]", "[", "key", 0, "]", "[", "temporalmode", "none", "]", "[", "extend", 0, "]", "[", "width", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1079574528, "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 1, "]", "[", "access", "readandwrite", "]", "]", "[", 20, "[", "name", "slot 20", "]", "[", "type", "none", "]", "[", "key", 0, "]", "[", "temporalmode", "none", "]", "[", "extend", 0, "]", "[", "width", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1079574528, "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 0, "]", "[", "access", "readandwrite", "]", "]", "[", 21, "[", "name", "slot 21", "]", "[", "type", "none", "]", "[", "key", 0, "]", "[", "temporalmode", "none", "]", "[", "extend", 0, "]", "[", "width", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1079574528, "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 0, "]", "[", "access", "readandwrite", "]", "]", "[", 22, "[", "name", "slot 22", "]", "[", "type", "none", "]", "[", "key", 0, "]", "[", "temporalmode", "none", "]", "[", "extend", 0, "]", "[", "width", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1079574528, "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 1, "]", "[", "access", "readandwrite", "]", "]", "[", 23, "[", "name", "slot 23", "]", "[", "type", "none", "]", "[", "key", 0, "]", "[", "temporalmode", "none", "]", "[", "extend", 0, "]", "[", "width", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1079574528, "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 1, "]", "[", "access", "readandwrite", "]", "]", "[", 24, "[", "name", "slot 24", "]", "[", "type", "none", "]", "[", "key", 0, "]", "[", "temporalmode", "none", "]", "[", "extend", 0, "]", "[", "width", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1079574528, "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 1, "]", "[", "access", "readandwrite", "]", "]", "[", 25, "[", "name", "slot 25", "]", "[", "type", "none", "]", "[", "key", 0, "]", "[", "temporalmode", "none", "]", "[", "extend", 0, "]", "[", "width", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1079574528, "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 1, "]", "[", "access", "readandwrite", "]", "]", "[", 26, "[", "name", "slot 26", "]", "[", "type", "none", "]", "[", "key", 0, "]", "[", "temporalmode", "none", "]", "[", "extend", 0, "]", "[", "width", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1079574528, "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 1, "]", "[", "access", "readandwrite", "]", "]", "[", 27, "[", "name", "slot 27", "]", "[", "type", "none", "]", "[", "key", 0, "]", "[", "temporalmode", "none", "]", "[", "extend", 0, "]", "[", "width", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1079574528, "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 1, "]", "[", "access", "readandwrite", "]", "]", "[", 28, "[", "name", "slot 28", "]", "[", "type", "none", "]", "[", "key", 0, "]", "[", "temporalmode", "none", "]", "[", "extend", 0, "]", "[", "width", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1079574528, "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 1, "]", "[", "access", "readandwrite", "]", "]", "[", 29, "[", "name", "slot 29", "]", "[", "type", "none", "]", "[", "key", 0, "]", "[", "temporalmode", "none", "]", "[", "extend", 0, "]", "[", "width", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1079574528, "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 1, "]", "[", "access", "readandwrite", "]", "]", "[", 30, "[", "name", "slot 30", "]", "[", "type", "none", "]", "[", "key", 0, "]", "[", "temporalmode", "none", "]", "[", "extend", 0, "]", "[", "width", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1079574528, "]", "[", "height", "auto", "]", "[", "singleslotfortiednotes", 1, "]", "[", "copywhensplit", 1, "]", "[", "access", "readandwrite", "]", "]", "]", "[", "commands", "[", 1, "[", "note", "notecmd", "]", "[", "chord", "chordcmd", "]", "[", "rest", "rest", "]", "[", "key", 0, "]", "]", "[", 2, "[", "note", "notecmd", "]", "[", "chord", "chordcmd", "]", "[", "rest", "rest", "]", "[", "key", 0, "]", "]", "[", 3, "[", "note", "notecmd", "]", "[", "chord", "chordcmd", "]", "[", "rest", "rest", "]", "[", "key", 0, "]", "]", "[", 4, "[", "note", "notecmd", "]", "[", "chord", "chordcmd", "]", "[", "rest", "rest", "]", "[", "key", 0, "]", "]", "[", 5, "[", "note", "notecmd", "]", "[", "chord", "chordcmd", "]", "[", "rest", "rest", "]", "[", "key", 0, "]", "]", "]", "[", "markers", "]", "[", "midichannels", 1, "]", "[", "articulationinfo", "]", "[", "noteheadinfo", "]", "[", "[", "[", "[", 4, 4, "]", "[", "]", "]", "[", "leveltype", 1, "]", "[", "[", "leveltype", 24, "]", "[", "1/12", "[", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1086147584, 127, 0, 0, "]", 0, "]", "[", "1/12", "[", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1085865984, 127, 0, 0, "]", 0, "]", "[", "1/12", "[", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1086045184, 127, 0, 0, "]", 0, "]", "]", "[", "[", "leveltype", 8, "]", "[", "1/8", "[", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1086070784, 127, 0, 0, "]", 0, "]", "[", "1/8", "[", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1085891584, 127, 0, 0, "]", 0, "]", "]", "[", "[", "leveltype", 8, "]", "[", "3/16", "[", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1086301184, 127, 0, 0, "]", 0, "]", "[", "1/16", "[", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1085993984, 127, 0, 0, "]", 0, "]", "]", "[", "[", "leveltype", 8, "]", "[", "1/8", "[", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1086096384, 127, 0, 0, "]", "[", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1086338560, 127, 0, 0, "]", 0, "]", "[", "1/8", "[", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1085942784, 127, 0, 0, "]", "[", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1086338560, 127, 1, 0, "]", 0, "]", "]", 0, "]", "[", "[", "[", 4, 4, "]", "[", "]", "]", "[", "leveltype", 1, "]", "[", "[", "leveltype", 8, "]", "[", "1/4", "[", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1086338560, 127, 1, 0, "]", "[", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1086415360, 127, 0, 0, "]", 0, "]", "]", "[", "[", "leveltype", 24, "]", "[", "1/12", "[", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1086338560, 127, 0, 0, "]", 0, "]", "[", "1/6", "[", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1086338560, 127, 0, 0, "]", 0, "]", "]", "[", "[", "leveltype", 24, "]", "[", "1/6", "[", "_x_x_x_x_bach_float64_x_x_x_x_", 549756, 1086092726, 127, 0, 0, "]", 0, "]", "[", "1/12", "[", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1085865984, 127, 1, 0, "]", 0, "]", "]", "[", "[", "leveltype", 24, "]", "[", "1/28", "[", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1085865984, 127, 0, 0, "]", 0, "]", "[", "1/28", "[", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1085968384, 127, 0, 0, "]", 0, "]", "[", "1/28", "[", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1085865984, 127, 0, 0, "]", 0, "]", "[", "1/28", "[", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1085865984, 127, 0, 0, "]", 0, "]", "[", "1/28", "[", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1085789184, 127, 0, 0, "]", 0, "]", "[", "1/28", "[", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1085865984, 127, 0, 0, "]", 0, "]", "[", "1/28", "[", "_x_x_x_x_bach_float64_x_x_x_x_", 0, 1085865984, 127, 0, 0, "]", 0, "]", "]", 0, "]", 0, "]" ],
					"whole_score_data_count" : [ 1 ],
					"zoom" : 107.03125
				}

			}
, 			{
				"box" : 				{
					"fontface" : 2,
					"fontname" : "Arial",
					"fontsize" : 12.0,
					"id" : "obj-256",
					"maxclass" : "comment",
					"numinlets" : 1,
					"numoutlets" : 0,
					"patching_rect" : [ 475.0, 539.0, 229.0, 20.0 ],
					"text" : "...yzarc teg thgim I gnihtyreve esrever I fI",
					"textcolor" : [ 0.0, 0.168627, 0.67451, 1.0 ]
				}

			}
, 			{
				"box" : 				{
					"fontname" : "Arial",
					"fontsize" : 12.0,
					"id" : "obj-49",
					"maxclass" : "comment",
					"numinlets" : 1,
					"numoutlets" : 0,
					"patching_rect" : [ 1.0, 16.0, 444.0, 20.0 ],
					"text" : "_________________________________________________________________"
				}

			}
, 			{
				"box" : 				{
					"fontname" : "Arial Italic",
					"fontsize" : 16.787033000000001,
					"id" : "obj-50",
					"maxclass" : "comment",
					"numinlets" : 1,
					"numoutlets" : 0,
					"patching_rect" : [ 314.0, 6.74086, 200.0, 25.0 ],
					"text" : "- all reversed"
				}

			}
, 			{
				"box" : 				{
					"fontname" : "Arial",
					"fontsize" : 22.256727000000001,
					"id" : "obj-13",
					"maxclass" : "comment",
					"numinlets" : 1,
					"numoutlets" : 0,
					"patching_rect" : [ 2.0, 1.924051, 318.0, 31.0 ],
					"text" : "Through The Looking Glass (k)"
				}

			}
, 			{
				"box" : 				{
					"hidden" : 1,
					"id" : "obj-4",
					"maxclass" : "newobj",
					"numinlets" : 1,
					"numoutlets" : 1,
					"outlettype" : [ "" ],
					"patching_rect" : [ 5.0, 665.0, 140.0, 22.0 ],
					"text" : "pcontrol",
					"varname" : "pcontrolA"
				}

			}
, 			{
				"box" : 				{
					"hidden" : 1,
					"id" : "obj-6",
					"maxclass" : "newobj",
					"numinlets" : 1,
					"numoutlets" : 1,
					"outlettype" : [ "" ],
					"patching_rect" : [ 5.0, 640.0, 140.0, 22.0 ],
					"text" : "prepend load",
					"varname" : "prependA"
				}

			}
, 			{
				"box" : 				{
					"hidden" : 1,
					"id" : "obj-18",
					"maxclass" : "newobj",
					"numinlets" : 1,
					"numoutlets" : 1,
					"outlettype" : [ "" ],
					"patching_rect" : [ 5.0, 615.0, 140.0, 22.0 ],
					"text" : "tosymbol",
					"varname" : "tosymbolA"
				}

			}
, 			{
				"box" : 				{
					"hidden" : 1,
					"id" : "obj-21",
					"linecount" : 2,
					"maxclass" : "message",
					"numinlets" : 2,
					"numoutlets" : 1,
					"outlettype" : [ "" ],
					"patching_rect" : [ 5.0, 590.0, 140.0, 35.0 ],
					"text" : "Through The Looking Glass (j)",
					"varname" : "messageA"
				}

			}
, 			{
				"box" : 				{
					"hidden" : 1,
					"id" : "obj-22",
					"maxclass" : "newobj",
					"numinlets" : 1,
					"numoutlets" : 2,
					"outlettype" : [ "bang", "bang" ],
					"patching_rect" : [ 5.0, 565.0, 40.0, 22.0 ],
					"text" : "t b b",
					"varname" : "triggerA"
				}

			}
, 			{
				"box" : 				{
					"bgcolor" : [ 0.75, 0.75, 0.75, 1.0 ],
					"bgoncolor" : [ 0.51, 0.59, 0.64, 1.0 ],
					"fontface" : 2,
					"id" : "obj-24",
					"maxclass" : "textbutton",
					"numinlets" : 1,
					"numoutlets" : 3,
					"outlettype" : [ "", "", "int" ],
					"parameter_enable" : 0,
					"patching_rect" : [ 5.0, 540.0, 151.0, 20.0 ],
					"text" : "Back to section (j)",
					"varname" : "textbuttonA"
				}

			}
, 			{
				"box" : 				{
					"hidden" : 1,
					"id" : "obj-25",
					"maxclass" : "newobj",
					"numinlets" : 1,
					"numoutlets" : 1,
					"outlettype" : [ "" ],
					"patching_rect" : [ 707.0, 665.0, 140.0, 22.0 ],
					"text" : "pcontrol",
					"varname" : "pcontrolB"
				}

			}
, 			{
				"box" : 				{
					"hidden" : 1,
					"id" : "obj-26",
					"maxclass" : "newobj",
					"numinlets" : 1,
					"numoutlets" : 1,
					"outlettype" : [ "" ],
					"patching_rect" : [ 707.0, 640.0, 140.0, 22.0 ],
					"text" : "prepend load",
					"varname" : "prependB"
				}

			}
, 			{
				"box" : 				{
					"hidden" : 1,
					"id" : "obj-27",
					"maxclass" : "newobj",
					"numinlets" : 1,
					"numoutlets" : 1,
					"outlettype" : [ "" ],
					"patching_rect" : [ 707.0, 615.0, 140.0, 22.0 ],
					"text" : "tosymbol",
					"varname" : "tosymbolB"
				}

			}
, 			{
				"box" : 				{
					"hidden" : 1,
					"id" : "obj-29",
					"linecount" : 2,
					"maxclass" : "message",
					"numinlets" : 2,
					"numoutlets" : 1,
					"outlettype" : [ "" ],
					"patching_rect" : [ 707.0, 590.0, 140.0, 35.0 ],
					"text" : "Through The Looking Glass (l)",
					"varname" : "messageB"
				}

			}
, 			{
				"box" : 				{
					"hidden" : 1,
					"id" : "obj-30",
					"maxclass" : "newobj",
					"numinlets" : 1,
					"numoutlets" : 2,
					"outlettype" : [ "bang", "bang" ],
					"patching_rect" : [ 707.0, 565.0, 40.0, 22.0 ],
					"text" : "t b b",
					"varname" : "triggerB"
				}

			}
, 			{
				"box" : 				{
					"bgcolor" : [ 0.75, 0.75, 0.75, 1.0 ],
					"bgoncolor" : [ 0.51, 0.59, 0.64, 1.0 ],
					"fontface" : 2,
					"id" : "obj-36",
					"maxclass" : "textbutton",
					"numinlets" : 1,
					"numoutlets" : 3,
					"outlettype" : [ "", "", "int" ],
					"parameter_enable" : 0,
					"patching_rect" : [ 707.0, 540.0, 151.0, 20.0 ],
					"text" : "Continue to section (l)",
					"varname" : "textbuttonB"
				}

			}
 ],
		"lines" : [ 			{
				"patchline" : 				{
					"destination" : [ "obj-3", 0 ],
					"source" : [ "obj-1", 0 ]
				}

			}
, 			{
				"patchline" : 				{
					"destination" : [ "obj-8", 0 ],
					"midpoints" : [ 715.5, 213.0, 734.0, 213.0, 734.0, 75.0, 13.5, 75.0 ],
					"source" : [ "obj-1", 8 ]
				}

			}
, 			{
				"patchline" : 				{
					"destination" : [ "obj-15", 0 ],
					"source" : [ "obj-10", 0 ]
				}

			}
, 			{
				"patchline" : 				{
					"destination" : [ "obj-5", 0 ],
					"source" : [ "obj-11", 0 ]
				}

			}
, 			{
				"patchline" : 				{
					"color" : [ 0.627451, 0.458824, 0.172549, 0.466667 ],
					"destination" : [ "obj-39", 0 ],
					"order" : 1,
					"source" : [ "obj-15", 0 ]
				}

			}
, 			{
				"patchline" : 				{
					"color" : [ 0.627451, 0.458824, 0.172549, 0.466667 ],
					"destination" : [ "obj-45", 0 ],
					"order" : 0,
					"source" : [ "obj-15", 0 ]
				}

			}
, 			{
				"patchline" : 				{
					"color" : [ 0.627451, 0.458824, 0.172549, 0.466667 ],
					"destination" : [ "obj-9", 0 ],
					"order" : 2,
					"source" : [ "obj-15", 0 ]
				}

			}
, 			{
				"patchline" : 				{
					"destination" : [ "obj-10", 0 ],
					"hidden" : 1,
					"source" : [ "obj-17", 0 ]
				}

			}
, 			{
				"patchline" : 				{
					"destination" : [ "obj-6", 0 ],
					"hidden" : 1,
					"source" : [ "obj-18", 0 ]
				}

			}
, 			{
				"patchline" : 				{
					"destination" : [ "obj-51", 0 ],
					"hidden" : 1,
					"source" : [ "obj-19", 0 ]
				}

			}
, 			{
				"patchline" : 				{
					"destination" : [ "obj-11", 2 ],
					"source" : [ "obj-2", 0 ]
				}

			}
, 			{
				"patchline" : 				{
					"destination" : [ "obj-18", 0 ],
					"hidden" : 1,
					"source" : [ "obj-21", 0 ]
				}

			}
, 			{
				"patchline" : 				{
					"destination" : [ "obj-19", 0 ],
					"hidden" : 1,
					"source" : [ "obj-22", 0 ]
				}

			}
, 			{
				"patchline" : 				{
					"destination" : [ "obj-21", 0 ],
					"hidden" : 1,
					"source" : [ "obj-22", 1 ]
				}

			}
, 			{
				"patchline" : 				{
					"destination" : [ "obj-22", 0 ],
					"hidden" : 1,
					"source" : [ "obj-24", 0 ]
				}

			}
, 			{
				"patchline" : 				{
					"destination" : [ "obj-25", 0 ],
					"hidden" : 1,
					"source" : [ "obj-26", 0 ]
				}

			}
, 			{
				"patchline" : 				{
					"destination" : [ "obj-26", 0 ],
					"hidden" : 1,
					"source" : [ "obj-27", 0 ]
				}

			}
, 			{
				"patchline" : 				{
					"destination" : [ "obj-27", 0 ],
					"hidden" : 1,
					"source" : [ "obj-29", 0 ]
				}

			}
, 			{
				"patchline" : 				{
					"destination" : [ "obj-11", 0 ],
					"source" : [ "obj-3", 0 ]
				}

			}
, 			{
				"patchline" : 				{
					"destination" : [ "obj-2", 0 ],
					"source" : [ "obj-3", 2 ]
				}

			}
, 			{
				"patchline" : 				{
					"destination" : [ "obj-39", 1 ],
					"source" : [ "obj-3", 3 ]
				}

			}
, 			{
				"patchline" : 				{
					"destination" : [ "obj-40", 1 ],
					"order" : 0,
					"source" : [ "obj-3", 4 ]
				}

			}
, 			{
				"patchline" : 				{
					"destination" : [ "obj-45", 1 ],
					"order" : 1,
					"source" : [ "obj-3", 4 ]
				}

			}
, 			{
				"patchline" : 				{
					"destination" : [ "obj-9", 1 ],
					"source" : [ "obj-3", 1 ]
				}

			}
, 			{
				"patchline" : 				{
					"destination" : [ "obj-19", 0 ],
					"hidden" : 1,
					"source" : [ "obj-30", 0 ]
				}

			}
, 			{
				"patchline" : 				{
					"destination" : [ "obj-29", 0 ],
					"hidden" : 1,
					"source" : [ "obj-30", 1 ]
				}

			}
, 			{
				"patchline" : 				{
					"color" : [ 1.0, 0.835294, 0.0, 1.0 ],
					"destination" : [ "obj-1", 0 ],
					"midpoints" : [ 628.5, 96.0, 13.5, 96.0 ],
					"source" : [ "obj-31", 0 ]
				}

			}
, 			{
				"patchline" : 				{
					"destination" : [ "obj-11", 3 ],
					"source" : [ "obj-33", 0 ]
				}

			}
, 			{
				"patchline" : 				{
					"destination" : [ "obj-30", 0 ],
					"hidden" : 1,
					"source" : [ "obj-36", 0 ]
				}

			}
, 			{
				"patchline" : 				{
					"destination" : [ "obj-1", 0 ],
					"hidden" : 1,
					"source" : [ "obj-37", 0 ]
				}

			}
, 			{
				"patchline" : 				{
					"destination" : [ "obj-37", 0 ],
					"hidden" : 1,
					"source" : [ "obj-38", 0 ]
				}

			}
, 			{
				"patchline" : 				{
					"destination" : [ "obj-11", 3 ],
					"midpoints" : [ 339.5, 325.0, 364.300000000000011, 325.0 ],
					"source" : [ "obj-39", 0 ]
				}

			}
, 			{
				"patchline" : 				{
					"destination" : [ "obj-33", 0 ],
					"source" : [ "obj-39", 1 ]
				}

			}
, 			{
				"patchline" : 				{
					"destination" : [ "obj-11", 4 ],
					"source" : [ "obj-40", 0 ]
				}

			}
, 			{
				"patchline" : 				{
					"destination" : [ "obj-11", 4 ],
					"source" : [ "obj-45", 0 ]
				}

			}
, 			{
				"patchline" : 				{
					"destination" : [ "obj-51", 0 ],
					"hidden" : 1,
					"midpoints" : [ 343.0, 678.0, 327.0, 678.0, 327.0, 619.5, 343.0, 619.5 ],
					"source" : [ "obj-47", 0 ]
				}

			}
, 			{
				"patchline" : 				{
					"destination" : [ "obj-47", 0 ],
					"hidden" : 1,
					"source" : [ "obj-51", 0 ]
				}

			}
, 			{
				"patchline" : 				{
					"destination" : [ "obj-4", 0 ],
					"hidden" : 1,
					"source" : [ "obj-6", 0 ]
				}

			}
, 			{
				"patchline" : 				{
					"destination" : [ "obj-11", 1 ],
					"source" : [ "obj-7", 0 ]
				}

			}
, 			{
				"patchline" : 				{
					"destination" : [ "obj-5", 0 ],
					"hidden" : 1,
					"source" : [ "obj-78", 0 ]
				}

			}
, 			{
				"patchline" : 				{
					"destination" : [ "obj-1", 0 ],
					"source" : [ "obj-8", 0 ]
				}

			}
, 			{
				"patchline" : 				{
					"destination" : [ "obj-11", 1 ],
					"midpoints" : [ 164.5, 326.0, 189.099999999999994, 326.0 ],
					"source" : [ "obj-9", 0 ]
				}

			}
, 			{
				"patchline" : 				{
					"destination" : [ "obj-40", 0 ],
					"order" : 0,
					"source" : [ "obj-9", 1 ]
				}

			}
, 			{
				"patchline" : 				{
					"destination" : [ "obj-7", 0 ],
					"order" : 1,
					"source" : [ "obj-9", 1 ]
				}

			}
 ],
		"dependency_cache" : [ 			{
				"name" : "bach.tierev.maxpat",
				"bootpath" : "~/Documents/Max 7/Packages/bach/patchers",
				"patcherrelativepath" : "../../patchers",
				"type" : "JSON",
				"implicit" : 1
			}
, 			{
				"name" : "bach.replace.maxpat",
				"bootpath" : "~/Documents/Max 7/Packages/bach/patchers",
				"patcherrelativepath" : "../../patchers",
				"type" : "JSON",
				"implicit" : 1
			}
, 			{
				"name" : "bach.lookup.maxpat",
				"bootpath" : "~/Documents/Max 7/Packages/bach/patchers",
				"patcherrelativepath" : "../../patchers",
				"type" : "JSON",
				"implicit" : 1
			}
, 			{
				"name" : "bach.filternull.maxpat",
				"bootpath" : "~/Documents/Max 7/Packages/bach/patchers",
				"patcherrelativepath" : "../../patchers",
				"type" : "JSON",
				"implicit" : 1
			}
, 			{
				"name" : "linksections.maxpat",
				"bootpath" : "~/Documents/Max 7/Packages/bach/docs/tutorial-patchers",
				"patcherrelativepath" : ".",
				"type" : "JSON",
				"implicit" : 1
			}
, 			{
				"name" : "bach.score.mxo",
				"type" : "iLaX"
			}
, 			{
				"name" : "bach.beatunbox.mxo",
				"type" : "iLaX"
			}
, 			{
				"name" : "bach.beatbox.mxo",
				"type" : "iLaX"
			}
, 			{
				"name" : "bach.rev.mxo",
				"type" : "iLaX"
			}
, 			{
				"name" : "bach.portal.mxo",
				"type" : "iLaX"
			}
, 			{
				"name" : "bach.iter.mxo",
				"type" : "iLaX"
			}
, 			{
				"name" : "bach.find.mxo",
				"type" : "iLaX"
			}
, 			{
				"name" : "bach.flat.mxo",
				"type" : "iLaX"
			}
, 			{
				"name" : "bach.subs.mxo",
				"type" : "iLaX"
			}
, 			{
				"name" : "bach.reg.mxo",
				"type" : "iLaX"
			}
, 			{
				"name" : "bach.args.mxo",
				"type" : "iLaX"
			}
, 			{
				"name" : "bach.slice.mxo",
				"type" : "iLaX"
			}
, 			{
				"name" : "bach.nth.mxo",
				"type" : "iLaX"
			}
, 			{
				"name" : "bach.eq.mxo",
				"type" : "iLaX"
			}
, 			{
				"name" : "bach.collect.mxo",
				"type" : "iLaX"
			}
, 			{
				"name" : "bach.depth.mxo",
				"type" : "iLaX"
			}
, 			{
				"name" : "bach.wrap.mxo",
				"type" : "iLaX"
			}
 ],
		"autosave" : 0
	}

}
